spec/cassettes/Stripe_Events/charge_events/charge_failed/sends_an_email.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/events/evt_172KZSFsBqZq4amVbL6Z9EEk
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.30.2
      Authorization:
      - Bearer sk_test_GL2nS6KhsUkCBoHmnWD8y1MT
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.30.2","lang":"ruby","lang_version":"2.1.7 p400 (2015-08-18)","platform":"x86_64-linux","engine":"ruby","publisher":"stripe","uname":"Linux
        version 3.5.0-54-generic (buildd@allspice) (gcc version 4.6.3 (Ubuntu/Linaro
        4.6.3-1ubuntu5) ) #81~precise1-Ubuntu SMP Tue Jul 15 04:02:22 UTC 2014","hostname":"leanetic"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sun, 01 Nov 2015 12:23:39 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1954'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_7GsdGIL1uFkLDE
      Stripe-Version:
      - '2015-10-16'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "evt_172KZSFsBqZq4amVbL6Z9EEk",
          "object": "event",
          "api_version": "2015-10-16",
          "created": 1446379466,
          "data": {
            "object": {
              "id": "ch_172KZSFsBqZq4amVVH7BwmoF",
              "object": "charge",
              "amount": 999,
              "amount_refunded": 0,
              "application_fee": null,
              "balance_transaction": null,
              "captured": false,
              "created": 1446379466,
              "currency": "eur",
              "customer": "cus_7GsG8JKpcmWy6s",
              "description": "",
              "destination": null,
              "dispute": null,
              "failure_code": "card_declined",
              "failure_message": "Your card was declined.",
              "fraud_details": {},
              "invoice": null,
              "livemode": false,
              "metadata": {},
              "paid": false,
              "receipt_email": null,
              "receipt_number": null,
              "refunded": false,
              "refunds": {
                "object": "list",
                "data": [],
                "has_more": false,
                "total_count": 0,
                "url": "/v1/charges/ch_172KZSFsBqZq4amVVH7BwmoF/refunds"
              },
              "shipping": null,
              "source": {
                "id": "card_172KXxFsBqZq4amVYAHVgD0P",
                "object": "card",
                "address_city": null,
                "address_country": null,
                "address_line1": null,
                "address_line1_check": null,
                "address_line2": null,
                "address_state": null,
                "address_zip": null,
                "address_zip_check": null,
                "brand": "Visa",
                "country": "US",
                "customer": "cus_7GsG8JKpcmWy6s",
                "cvc_check": "pass",
                "dynamic_last4": null,
                "exp_month": 11,
                "exp_year": 2017,
                "fingerprint": "2oXXqsiTLEoONryH",
                "funding": "credit",
                "last4": "0341",
                "metadata": {},
                "name": null,
                "tokenization_method": null
              },
              "statement_descriptor": null,
              "status": "failed"
            }
          },
          "livemode": false,
          "pending_webhooks": 1,
          "request": "req_7GsKJrwbdT2TGi",
          "type": "charge.failed"
        }
    http_version: 
  recorded_at: Sun, 01 Nov 2015 12:23:39 GMT
recorded_with: VCR 2.9.3
