spec/cassettes/Stripe_Events/charge_events/charge_succeeded/associates_the_payment_with_the_user.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/events/evt_171NFlFsBqZq4amV27Bkc7YO
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.30.2
      Authorization:
      - Bearer sk_test_GL2nS6KhsUkCBoHmnWD8y1MT
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.30.2","lang":"ruby","lang_version":"2.1.7 p400 (2015-08-18)","platform":"x86_64-linux","engine":"ruby","publisher":"stripe","uname":"Linux
        version 3.5.0-54-generic (buildd@allspice) (gcc version 4.6.3 (Ubuntu/Linaro
        4.6.3-1ubuntu5) ) #81~precise1-Ubuntu SMP Tue Jul 15 04:02:22 UTC 2014","hostname":"leanetic"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sun, 01 Nov 2015 12:23:44 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1992'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_7GsdjPuej55R1T
      Stripe-Version:
      - '2015-10-16'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "evt_171NFlFsBqZq4amV27Bkc7YO",
          "object": "event",
          "api_version": "2015-10-16",
          "created": 1446151449,
          "data": {
            "object": {
              "id": "ch_171NFkFsBqZq4amV41bQYS9B",
              "object": "charge",
              "amount": 999,
              "amount_refunded": 0,
              "application_fee": null,
              "balance_transaction": "txn_171NFkFsBqZq4amVebFcBAqX",
              "captured": true,
              "created": 1446151448,
              "currency": "eur",
              "customer": "cus_7Ft1EjfovZ9ipp",
              "description": null,
              "destination": null,
              "dispute": null,
              "failure_code": null,
              "failure_message": null,
              "fraud_details": {},
              "invoice": "in_171NFkFsBqZq4amVLnVD6RHg",
              "livemode": false,
              "metadata": {},
              "paid": true,
              "receipt_email": null,
              "receipt_number": null,
              "refunded": false,
              "refunds": {
                "object": "list",
                "data": [],
                "has_more": false,
                "total_count": 0,
                "url": "/v1/charges/ch_171NFkFsBqZq4amV41bQYS9B/refunds"
              },
              "shipping": null,
              "source": {
                "id": "card_171NFjFsBqZq4amVcPla2v1w",
                "object": "card",
                "address_city": null,
                "address_country": null,
                "address_line1": null,
                "address_line1_check": null,
                "address_line2": null,
                "address_state": null,
                "address_zip": null,
                "address_zip_check": null,
                "brand": "Visa",
                "country": "US",
                "customer": "cus_7Ft1EjfovZ9ipp",
                "cvc_check": "pass",
                "dynamic_last4": null,
                "exp_month": 10,
                "exp_year": 2015,
                "fingerprint": "e3sVIRmaBvs743cW",
                "funding": "credit",
                "last4": "4242",
                "metadata": {},
                "name": null,
                "tokenization_method": null
              },
              "statement_descriptor": "myflix standard",
              "status": "succeeded"
            }
          },
          "livemode": false,
          "pending_webhooks": 0,
          "request": "req_7Ft16k7o3D65I1",
          "type": "charge.succeeded"
        }
    http_version: 
  recorded_at: Sun, 01 Nov 2015 12:23:44 GMT
recorded_with: VCR 2.9.3
